flowforge/load-testing/results/limit_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/webhook_load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m10s max duration (incl. graceful stop):
              * ramp: Up to 20 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 10s)

time="2026-06-15T17:41:19Z" level=info msg="setup: workflow=65424988-454f-4a3c-b1f4-9b24f3d8b0c4 delayMs=150 webhookKey=Z88FFvKF..." source=console

running (0m01.0s), 02/20 VUs, 455 complete and 0 interrupted iterations
ramp   [   1% ] 02/20 VUs  0m00.8s/1m00.0s

running (0m02.0s), 04/20 VUs, 1397 complete and 0 interrupted iterations
ramp   [   3% ] 04/20 VUs  0m01.8s/1m00.0s

running (0m03.0s), 06/20 VUs, 2238 complete and 0 interrupted iterations
ramp   [   5% ] 06/20 VUs  0m02.8s/1m00.0s

running (0m04.0s), 08/20 VUs, 3383 complete and 0 interrupted iterations
ramp   [   6% ] 08/20 VUs  0m03.8s/1m00.0s

running (0m05.0s), 10/20 VUs, 4538 complete and 0 interrupted iterations
ramp   [   8% ] 10/20 VUs  0m04.8s/1m00.0s

running (0m06.0s), 12/20 VUs, 5782 complete and 0 interrupted iterations
ramp   [  10% ] 12/20 VUs  0m05.8s/1m00.0s

running (0m07.0s), 13/20 VUs, 7404 complete and 0 interrupted iterations
ramp   [  11% ] 13/20 VUs  0m06.8s/1m00.0s

running (0m08.0s), 15/20 VUs, 8730 complete and 0 interrupted iterations
ramp   [  13% ] 15/20 VUs  0m07.8s/1m00.0s

running (0m09.0s), 17/20 VUs, 10394 complete and 0 interrupted iterations
ramp   [  15% ] 17/20 VUs  0m08.8s/1m00.0s

running (0m10.0s), 19/20 VUs, 11940 complete and 0 interrupted iterations
ramp   [  16% ] 19/20 VUs  0m09.8s/1m00.0s

running (0m11.0s), 20/20 VUs, 13650 complete and 0 interrupted iterations
ramp   [  18% ] 20/20 VUs  0m10.8s/1m00.0s

running (0m12.0s), 20/20 VUs, 15206 complete and 0 interrupted iterations
ramp   [  20% ] 20/20 VUs  0m11.8s/1m00.0s

running (0m13.0s), 20/20 VUs, 16843 complete and 0 interrupted iterations
ramp   [  21% ] 20/20 VUs  0m12.8s/1m00.0s

running (0m14.0s), 20/20 VUs, 18268 complete and 0 interrupted iterations
ramp   [  23% ] 20/20 VUs  0m13.8s/1m00.0s

running (0m15.0s), 20/20 VUs, 20114 complete and 0 interrupted iterations
ramp   [  25% ] 20/20 VUs  0m14.8s/1m00.0s

running (0m16.0s), 20/20 VUs, 21514 complete and 0 interrupted iterations
ramp   [  26% ] 20/20 VUs  0m15.8s/1m00.0s

running (0m17.0s), 20/20 VUs, 23170 complete and 0 interrupted iterations
ramp   [  28% ] 20/20 VUs  0m16.8s/1m00.0s

running (0m18.0s), 20/20 VUs, 24783 complete and 0 interrupted iterations
ramp   [  30% ] 20/20 VUs  0m17.8s/1m00.0s

running (0m19.0s), 20/20 VUs, 26480 complete and 0 interrupted iterations
ramp   [  31% ] 20/20 VUs  0m18.8s/1m00.0s

running (0m20.0s), 20/20 VUs, 28156 complete and 0 interrupted iterations
ramp   [  33% ] 20/20 VUs  0m19.8s/1m00.0s

running (0m21.0s), 20/20 VUs, 29879 complete and 0 interrupted iterations
ramp   [  35% ] 20/20 VUs  0m20.8s/1m00.0s

running (0m22.0s), 20/20 VUs, 31687 complete and 0 interrupted iterations
ramp   [  36% ] 20/20 VUs  0m21.8s/1m00.0s

running (0m23.0s), 20/20 VUs, 32995 complete and 0 interrupted iterations
ramp   [  38% ] 20/20 VUs  0m22.8s/1m00.0s

running (0m24.0s), 20/20 VUs, 34796 complete and 0 interrupted iterations
ramp   [  40% ] 20/20 VUs  0m23.8s/1m00.0s

running (0m25.0s), 20/20 VUs, 36421 complete and 0 interrupted iterations
ramp   [  41% ] 20/20 VUs  0m24.8s/1m00.0s

running (0m26.0s), 20/20 VUs, 37915 complete and 0 interrupted iterations
ramp   [  43% ] 20/20 VUs  0m25.8s/1m00.0s

running (0m27.0s), 20/20 VUs, 39629 complete and 0 interrupted iterations
ramp   [  45% ] 20/20 VUs  0m26.8s/1m00.0s

running (0m28.0s), 20/20 VUs, 41307 complete and 0 interrupted iterations
ramp   [  46% ] 20/20 VUs  0m27.8s/1m00.0s

running (0m29.0s), 20/20 VUs, 42956 complete and 0 interrupted iterations
ramp   [  48% ] 20/20 VUs  0m28.8s/1m00.0s

running (0m30.0s), 20/20 VUs, 44701 complete and 0 interrupted iterations
ramp   [  50% ] 20/20 VUs  0m29.8s/1m00.0s

running (0m31.0s), 20/20 VUs, 46450 complete and 0 interrupted iterations
ramp   [  51% ] 20/20 VUs  0m30.8s/1m00.0s

running (0m32.0s), 20/20 VUs, 48071 complete and 0 interrupted iterations
ramp   [  53% ] 20/20 VUs  0m31.8s/1m00.0s

running (0m33.0s), 20/20 VUs, 49755 complete and 0 interrupted iterations
ramp   [  55% ] 20/20 VUs  0m32.8s/1m00.0s

running (0m34.0s), 20/20 VUs, 51330 complete and 0 interrupted iterations
ramp   [  56% ] 20/20 VUs  0m33.8s/1m00.0s

running (0m35.0s), 20/20 VUs, 53080 complete and 0 interrupted iterations
ramp   [  58% ] 20/20 VUs  0m34.8s/1m00.0s

running (0m36.0s), 20/20 VUs, 54731 complete and 0 interrupted iterations
ramp   [  60% ] 20/20 VUs  0m35.8s/1m00.0s

running (0m37.0s), 20/20 VUs, 56404 complete and 0 interrupted iterations
ramp   [  61% ] 20/20 VUs  0m36.8s/1m00.0s

running (0m38.0s), 20/20 VUs, 57873 complete and 0 interrupted iterations
ramp   [  63% ] 20/20 VUs  0m37.8s/1m00.0s

running (0m39.0s), 20/20 VUs, 59529 complete and 0 interrupted iterations
ramp   [  65% ] 20/20 VUs  0m38.8s/1m00.0s

running (0m40.0s), 20/20 VUs, 61221 complete and 0 interrupted iterations
ramp   [  66% ] 20/20 VUs  0m39.8s/1m00.0s

running (0m41.0s), 20/20 VUs, 63006 complete and 0 interrupted iterations
ramp   [  68% ] 20/20 VUs  0m40.8s/1m00.0s

running (0m42.0s), 20/20 VUs, 64778 complete and 0 interrupted iterations
ramp   [  70% ] 20/20 VUs  0m41.8s/1m00.0s

running (0m43.0s), 20/20 VUs, 66267 complete and 0 interrupted iterations
ramp   [  71% ] 20/20 VUs  0m42.8s/1m00.0s

running (0m44.0s), 20/20 VUs, 67925 complete and 0 interrupted iterations
ramp   [  73% ] 20/20 VUs  0m43.8s/1m00.0s

running (0m45.0s), 20/20 VUs, 69545 complete and 0 interrupted iterations
ramp   [  75% ] 20/20 VUs  0m44.8s/1m00.0s

running (0m46.0s), 20/20 VUs, 71384 complete and 0 interrupted iterations
ramp   [  76% ] 20/20 VUs  0m45.8s/1m00.0s

running (0m47.0s), 20/20 VUs, 72737 complete and 0 interrupted iterations
ramp   [  78% ] 20/20 VUs  0m46.8s/1m00.0s

running (0m48.0s), 20/20 VUs, 74381 complete and 0 interrupted iterations
ramp   [  80% ] 20/20 VUs  0m47.8s/1m00.0s

running (0m49.0s), 20/20 VUs, 75999 complete and 0 interrupted iterations
ramp   [  81% ] 20/20 VUs  0m48.8s/1m00.0s

running (0m50.0s), 20/20 VUs, 77748 complete and 0 interrupted iterations
ramp   [  83% ] 20/20 VUs  0m49.8s/1m00.0s

running (0m51.0s), 20/20 VUs, 79457 complete and 0 interrupted iterations
ramp   [  85% ] 20/20 VUs  0m50.8s/1m00.0s

running (0m52.0s), 20/20 VUs, 81154 complete and 0 interrupted iterations
ramp   [  86% ] 20/20 VUs  0m51.8s/1m00.0s

running (0m53.0s), 20/20 VUs, 82655 complete and 0 interrupted iterations
ramp   [  88% ] 20/20 VUs  0m52.8s/1m00.0s

running (0m54.0s), 20/20 VUs, 84331 complete and 0 interrupted iterations
ramp   [  90% ] 20/20 VUs  0m53.8s/1m00.0s

running (0m55.0s), 20/20 VUs, 86091 complete and 0 interrupted iterations
ramp   [  91% ] 20/20 VUs  0m54.8s/1m00.0s

running (0m56.0s), 20/20 VUs, 87734 complete and 0 interrupted iterations
ramp   [  93% ] 20/20 VUs  0m55.8s/1m00.0s

running (0m57.0s), 20/20 VUs, 89285 complete and 0 interrupted iterations
ramp   [  95% ] 20/20 VUs  0m56.8s/1m00.0s

running (0m58.0s), 20/20 VUs, 90804 complete and 0 interrupted iterations
ramp   [  96% ] 20/20 VUs  0m57.8s/1m00.0s

running (0m59.0s), 20/20 VUs, 92364 complete and 0 interrupted iterations
ramp   [  98% ] 20/20 VUs  0m58.8s/1m00.0s

running (1m00.0s), 20/20 VUs, 93912 complete and 0 interrupted iterations
ramp   [ 100% ] 20/20 VUs  0m59.8s/1m00.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1.0' rate=99.91%

    webhook_trigger_ms
    ✓ 'p(95)<60000' p(95)=22.92ms


  █ TOTAL RESULTS 

    checks_total.......: 188660 3134.14786/s
    checks_succeeded...: 50.04% 94406 out of 188660
    checks_failed......: 49.95% 94254 out of 188660

    ✓ register 201
    ✓ workflow 201
    ✓ graph 200
    ✓ webhook 201
    ✗ accepted 202
      ↳  0% — ✓ 74 / ✗ 94254
    ✓ not 5xx

    CUSTOM
    webhook_accepted_202...........: 74     1.229338/s
    webhook_rate_limited_429.......: 94254  1565.811366/s
    webhook_trigger_ms.............: avg=11.42ms min=580.92µs med=9.83ms  max=89.09ms  p(90)=18.51ms p(95)=22.92ms

    HTTP
    http_req_duration..............: avg=11.43ms min=580.92µs med=9.83ms  max=131.22ms p(90)=18.51ms p(95)=22.92ms
      { expected_response:true }...: avg=10.58ms min=1.6ms    med=3.95ms  max=131.22ms p(90)=30.79ms p(95)=31.94ms
    http_req_failed................: 99.91% 94254 out of 94333
    http_reqs......................: 94333  1567.123768/s

    EXECUTION
    iteration_duration.............: avg=11.64ms min=673.66µs med=10.01ms max=89.2ms   p(90)=18.81ms p(95)=23.26ms
    iterations.....................: 94328  1567.040704/s
    vus............................: 20     min=2              max=20
    vus_max........................: 20     min=20             max=20

    NETWORK
    data_received..................: 76 MB  1.3 MB/s
    data_sent......................: 18 MB  302 kB/s



running (1m00.2s), 00/20 VUs, 94328 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 00/20 VUs  1m0s